#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>
```

Success! The configuration is valid.


```
</details>
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>
```

terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_iam_openid_connect_provider.github_actions_IODC_provider will be created
  + resource "aws_iam_openid_connect_provider" "github_actions_IODC_provider" {
      + arn             = (known after apply)
      + client_id_list  = [
          + "sts.amazonaws.com",
        ]
      + id              = (known after apply)
      + tags            = {
          + "Project" = "rs-school"
        }
      + tags_all        = {
          + "Project" = "rs-school"
        }
      + thumbprint_list = [
          + "d89e3bd43d5d909b47a18977aa9d5ce36cee184c",
          + "1c58a3a8518e8759bf075b76b750d4f2df264fcd",
        ]
      + url             = "https://token.actions.githubusercontent.com"
    }

  # aws_iam_role.GithubActionsRole will be created
  + resource "aws_iam_role" "GithubActionsRole" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRoleWithWebIdentity"
                      + Condition = {
                          + StringEquals = {
                              + "token.actions.githubusercontent.com:aud" = "sts.amazonaws.com"
                            }
                          + StringLike   = {
                              + "token.actions.githubusercontent.com:sub" = "repo:SerPapanin/*"
                            }
                        }
                      + Effect    = "Allow"
                      + Principal = {
                          + Federated = "arn:aws:iam::440744237104:oidc-provider/token.actions.githubusercontent.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = [
          + "arn:aws:iam::aws:policy/AmazonEC2FullAccess",
          + "arn:aws:iam::aws:policy/AmazonEventBridgeFullAccess",
          + "arn:aws:iam::aws:policy/AmazonRoute53FullAccess",
          + "arn:aws:iam::aws:policy/AmazonS3FullAccess",
          + "arn:aws:iam::aws:policy/AmazonSQSFullAccess",
          + "arn:aws:iam::aws:policy/AmazonVPCFullAccess",
          + "arn:aws:iam::aws:policy/IAMFullAccess",
        ]
      + max_session_duration  = 3600
      + name                  = "GithubActionsRole"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "Project" = "rs-school"
        }
      + tags_all              = {
          + "Project" = "rs-school"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

Plan: 2 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```
</details>
*Pushed by: @SerPapanin, Action: `pull_request`*